from django.core.management.base import BaseCommand, CommandError
from posts.models import Post
from accounts.models import User

import random
from random import randint
import datetime

salary_list = ["3500 ~ 3700 만원", "4200 ~ 4300 만원", "2200 ~ 2500 만원", "3500 ~ 3700 만원", "4100 ~ 5000 만원"]
language_list = ["python","javascript","java","C++"]
content_list = ["서버 백엔드 엔지니어", "AI 개발자", "웹 프론트엔드 개발자", "UI/UX 디자이너"]
location_list = ["경기도 성남시 분당구", "서울특별시 강남구", "서울특별시 서초구", "서울특별시 동작구", "제주특별자치도 서귀포구", "대전광역시 유성구"]
career_list = ["신입", "경력"]

word_list = ['완성', '이달', '법칙', '서양', '위반', '약간', '정보', '회복', '애인', '항상', '한글', '숫자', '예식장', '산책', '취업', '신제품', '입사', '옷차림', '정문', '물결', '거울', '구름', '바이러스', '강원도', '이민', '창조', '오직', '제한', '녹차', '조각', '소나기', '공업',
 '영향', '실력', '구역', '원인', '식당', '경기', '기본', '생신', '관계', '줄무늬', '크림', '수년', '작성', '구속', '철학', '제삿날', '변신', '간섭', '무덤', '군인', '설치', '차림', '게시판', '학기', '부근', '경찰', '쌍둥이', '환경', '현상', '소속', '겨울', '꽃잎', '실감', '여고생', '출장', '빨리', '의욕', '타자기', '사계절', '얼음', '태풍', '퇴원', '순수', '계절', '신화', '시선', '중간', '현대', '달력',
 '센터', '화살', '단추', '중단', '서른', '참조', '관객', '실수', '유명', '금액', '상표', '지출', '현지', '설악산', '보라색', '밥그릇', '학력', '농구', '보통', '소원', '소설', '부인', '발음', '신발', '수염', '만족', '섭씨','극복', 
'편견', '에어컨', '수필', '하순', '대응', '건물', '딸아이', '캐릭터', '가끔', '철저히', '모양', '중독', '성공', '정원', '도자기', '말기', '식생활', '출입', '아쉬움', '실시', '담당', '구분', '생명', '결과', '이동', '목걸이', 
'한낮', '항구', '우산', '연습', '고객', '사물', '본성', '결정', '비난', '자격', '호텔', '심장', '채널', '일본', '각자', '세종대왕', '찌꺼기', '힘껏', '과정', '반죽', '분리', '원피스', '단골', '종소리', '녹음', '음악', '한꺼번에', 
'대단히', '연장', '시합', '미역', '장마', '반찬', '영화', '자신', '원래', '먼저', '남학생', '도입', '출발', '열매', '토마토', '빗방울', '육십', '이름', '출판', '기준', '여동생', '약품', '마라톤', '비중', '온종일', '철도', '교직', '범인', '학년', '색깔', '날짜', '볶음', '권위', '대학', '총장', '시민', '포스터', '서점', '교환', '시절', '먹이', '식탁', '연락', '구청', '악몽', '단어', '합리적', '인간', '국립', '갈증', '본사', '비용', '종교',
 '만두', '검사', '정말', '커튼', '현실', '전혀', '사냥', '충분히', '분량', '색연필', '학용품', '오랫동안', '인연', '결석', '숙소', '슬픔', '단풍', '촛불', '근래', '오월', '셋째', '박물관', '근로', '예금', '통역', '나흘', 
'세상', '발걸음', '소년', '인원', '스트레스', '부품', '현관', '흥미', '실현', '스웨터', '날개', '흔적', '여론', '재능', '가정', '일반', '대전', '마사지', '텔레비전', '말씀', '벌써', '지원', '부엌', '승진', '불교', '빗줄기', '초점', '작은딸', '활기', '강남', '토론', '신체', '관찰', '훈련', '할아버지', '속도', '생일', '물가', '기법', '일회용', '안내', '속담', '상점', '인격', '재판', '엊그제', '추천', '강의', '견해', '만약', '뉴욕', '분명', '육상', 
'팔십', '감기', '주머니', '타입', '골짜기', '일단', '실망', '변경', '음주', '수술', '몸살', '문제', '영상', '정리', '강도', '아나운서', '강사', '선전', '재학', '전용', '물론', '충청도', '통신', '천국', '한번', '유형', '목사', '교장', '경제', '승부', '대규모', '언론', '존재', '관람', '시험', '재채기', '물건', '매년', '충격', '창밖', '이론적', '도대체', '코끼리', '영혼', '국수', '수화기', '물리학', '횡단보도', '보장', '현장', '총각', '변화', '오히려', '일체', '정지', '성당']

class Command(BaseCommand):
    help = 'Populates the database. Deletes old entries'

    def handle(self, *args, **options):
        print("Populating...")

        for i in range(300):
            Post.objects.create(author=User.objects.get(is_active=True), title=word_list[i]+" 컴퍼니",content=random.sample(content_list,1)[0], language=random.sample(language_list,1)[0], salary=random.sample(salary_list,1)[0], location=random.sample(location_list,1)[0], career=random.sample(career_list,1)[0],  deadline=datetime.datetime(2021,randint(1,11),randint(1,25)))
        
        print("Done.") 